PODFoam/Run_Case_TF/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     PODFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         10000.0;

deltaT          1.0e-5;

writeControl    timeStep;

writeInterval  	2000;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  yes;

maxCo           1;

functions
{
    //#includeFunc "stressComponents"
   // #includeFunc "pressureCoefficient"
   // #includeFunc "sample"
   // #includeFunc "sampleCp"
   // #includeFunc "writeCellCentres"
   // #includeFunc "wallShearStress"
}

// ************************************************************************* //

