PODFoam/Run_Case_TF/system/sampleCp
type            patchProbes;
libs            ("libsampling.so");
writeControl    writeTime;

patch           lowerWall;
probeLocations  ();
fields          (cp);

